{
  "postArray": [
    {
      "postId": 12,
      "title": "post from ~2022 4th review",
      "content": "DAAAAAAMN, alright this one is going to tale a little bit longer than the rest! So far the lessons have \n                switched from play throughs to more standard written type lessons with more broad and applied challanges.\n                So far I have gotten about half way through the module and have finally realized that im not really programming\n                in JS, rather a particluler JS library called processing.js. I'm not even sure what this is used for specifically\n                but I have noticed when looking at other peoples JS code that this is substantially different. I don't know if \n                this is back or good, most likely neither, but I am going to press on and complete all the modules on KA so I can\n                hopefully have a stable foundation to build on later. ANYWAYYYYYYYY, so far in this module there is a challange to \n                work on or build a side scrolling game. A very basic one! I realized as soon as I started trying to work on it \n                that my skills or ability to understand how to actualize the things I wanted to do was very inadequet. At some\n                point shortly after I deleted all the provided code and began to build it up from the start. I took this entire\n                weekend basically to get it up and running. So I made my first little side scrolling game! Added a second level, \n                changed assets around, introduced a start screen as well as functional win/lose scenes! It is not much but\n                I am kind of proud of sticking through what was an awful start and now at this point, after hours and hours of\n                trouble shooting, as well as finding ways to solve my own problems on my own and with the help of STACKOVERFLOW \n                LOL I feel like although very little progress was made conpleting the module...my programming has gotten SO much\n                better! This review will have to be devided into a few sections I think as things are really slowing down but I am learning \n                a lot more doing these things myself. Anyway IMA GET back to it!",
      "date": "3/3/2024",
      "createdAt": "3/3/2024"
    },
    {
      "postId": 13,
      "title": "post from ~2022 3erd Review",
      "content": "OKAY!!!!!!Just finished SQL module. Interesting stuff. I am wondering how many back ends use SQL, once \n                again the language itself seems very intuative with creation of the tables and the querying of said tables.\n                Joining tables together, with outer and inner joins, left side and right side joins, this all starts to \n                really make senes after having some practice with the commands and getting comfortable with the idea that \n                you are literally writing into tables and organizing data in ever more interesting or useful ways! I \n                started off kind of struggling with this perhaps because it was my jump into a third langauge after only\n                programming for a few months seriously. However, like I mentioned above I was given the chance to use it \n                over and over and finally towards the end of the module it very much began to flow out of me much more \n                easily. Once again not giving up and repitition prevails! I have also began to try a new avenue of \n                memorization of programming concepts and commands. For the last two years, while I have been at work and \n                as a way to help better develope my memorization skills, after I finish listening to a podcast I try to \n                do a review of it in my own head immediatly after ends. In particular I go over who was in it, what were \n                the main themes, what was new information I learned, what was information that I may have changed my mind \n                about, and things of that nature. I repeat this process for every podcast I listen to, multiple times a \n                day. This <strong>REALLY</strong> has been helpful for me! So I have decided to apply a similar technique\n                with programming. As on my three work days I really don't get a serious chance to sit down and do some \n                studying I try to help myself as much as possible while at work. So in my head, when safe to do so, I \n                review the concepts and commands and their applications repeatedly throughout the day to help better make\n                new synaptic connections in my brain. In other words commit this stuff to memory! I'm sure this will help \n                as the general approach has already been amazing. BUT ANYWAY back to SQL...fundamentally the idea very much \n                makes sense to me. Make tables to drive data into them, try to construct the tables so the data can be \n                comfortably parsed together if need be. Query the tables for desired information, INSERT into them or \n                DELETE, only when appropriate. Pushing new table rows or columns into an already existing table is preferred\n                to updating the initial table build so the existing data does not get deleted or corrupted. There is an \n                importance to strictly giving out permissions to read/write into the tables as they may contain sensitive \n                personal info or <em>damage</em> can be done the the data. Partial permissions can be given, in general \n                however, access should be limited to back-end engineers. I honestly thought this would be super boring and \n                maybe at first it was but concept is certainly powerful. I'm not sure where in software, if at all, I will \n                end up but I want to try and not forget this stuff. If at all practical perhaps since this blog is in itself\n                a way to keep myeslf at least somewhat proficient in HTML/CSS, I wonder if I can run some SQL table along \n                side this blog...perhaps to push basic data into it from even my own usage or something like that. Just some \n                sort of reference I can occasionaly get into. Perhaps, trying to keep up with every language I learn along \n                the way is impractical, it may be. Too soon to tell for sure let us see where this endeavor goes. Also, from\n                here on out I have a new layout built for the blog using GRID structure instead of arbitrary YOLO style. I am\n                going to be sad to see my first version go but at least I won't get a headache looking at it anymore :)",
      "date": "3/3/2024",
      "createdAt": "3/3/2024"
    },
    {
      "postId": 14,
      "title": "post from ~2022: 2end Review",
      "content": "The basic layout of the HTML page is very nicely structured. That is\n        the first thing I\n        noticed. This structure gives a very intuitive start to using the system. Secondly, the way that CSS feeds into\n        it from a simple \"style\" function and works with a very straight forward heirarchy. Programming in general has\n        me very excited because as one thing begins to click it really starts to bring together everything else that has\n        been covered. I am looking forward to finishing this module and continueing this post through this weekend! yay\n        me! OKAY i just done did er. Finished the module like a good turbonerd should in a few days. The lessons through\n        Khan academy are a pretty good intro into using HTML and CSS as far as I can tell. At the end they left with\n        with both the resources and knowledge on how to keep on progressing further, which I really appreciated. Along\n        the way I found W3schools which seems to be the ultamite CSS cheat sheet! FUCK YES. There remain many things\n        that I want to implement on this little blog yet, not to mention make it look better over time. For instance I\n        need to know how to make different pages, buttons, JS animations etc. That being said, in the next two or three\n        modules with Khan there is promise of this to come! So this blog I hope will continue to be my side project\n        while learning through those modules, because implementing that information into a real world application has\n        been so very impactful to helping me understand how things really look outside the Khan liveview library wizard.\n        For instance, just the process of getting my own code editor set up with a live view, from which I am currently\n        writing, linking that editor to a local github, that pulls from a live repository that actually hosts this blog\n        onto a live page is kinda fucking huge. Feels real good man. Like I said earlier I really want to keep working\n        on this, not only to keep my skillset expanding with HTML/CSS, even though it is really outside my area of\n        interest, but also to keep applying things I learn to it from where my interest really lies. In the future I\n        really don't want to be doing these posts through a code editor at all, if thats possible. I would prefer to log\n        in to my blog, make a fresh post from a nice clean UI that I have somehow built and have it update and post into\n        the HTML for me with the layout I have designed.(going to be better than this for reals++).It seems that with\n        the more I learn so far the more excited I get for the possible things ahead. I really have to try and pace\n        myself at this point, the excitment is getting out of hand and I don't want it to lead to burnout.",
      "date": "3/3/2024",
      "createdAt": "3/3/2024"
    },
    {
      "postId": 15,
      "title": "Review from ~2022: First review",
      "content": "I have recently finished the first module of the programming course here on Khan Academy\n        and would like to jot down some thoughts about it! First off I would say that it was wildly successful! Most of\n        the concrete learning for a first time programmer really seemed to happen in the bonus material of each\n        challange.Although, many times I found myself stuck the sheer act of sticking with it and figuring things out,\n        either by hitting the documentation or other students comments, really made the most progress for me. Although\n        the tutorials and talk throughs are great, I think for the purpose of more effectively commiting these concepts\n        to memory the struggle of trying to figure things out and just simply trying things out is\n        <strong>huge</strong>. JavaScript itself seems to be rather intuitive, I am sure it is designed that way!\n        Getting a good grip on <em>for</em> loops and nested for loops is a huge help. There is an important thing I\n        would like to point out that took me a little while to realize. When for loops were first taught in the course\n        it did not click in for me that loops don't have to be set against array.length, they can in fact just be set to\n        an arbitrary amount. So as to say that if I need a loop to run 40 times, which I ended up doing, you can just\n        set i less than 40. DOES NOT NEED TO BE LESS THAN ARRAY.LENGTH. It was a huge moment for me when I finally\n        figured out that I can just make a for loop to push as many random numbers into an array as I needed, for\n        example in the make it rain project.",
      "date": "3/3/2024",
      "createdAt": "3/3/2024"
    },
    {
      "postId": 16,
      "title": "From Fed.10.2024 Here we go again",
      "content": "So!!!!!! on today's episode of derp, I spend the first few hours continueing the course material on Coursera. Then I spent hours and hours rebuilding a blog type page, or at least the beginnings of one using bootstrap. This has been a journey! Today is feb.10.2024 I started the online course on the fourth. The course itself has touched on bootstrap very lightly so far and this includes things like creating the div container, setting up rows, defining the number of columns you want the content to take up (of 12), setting breakpoints in the divs, dealing with images and setting their class attributes to fluid etc. Up to this point I have only made webpages with straight html and css, never a library so this has been like starting over essentially. Although I can certainly see the benefits of using bootstrap already when you know what you want and how to get their the prototyping must be nutty! So today I started this project your looking at now and learned some valueble things. For example, how to use the bootstrap docs LOL that seems like its going to be my home for the next little while! I messed around with making some cards and seeing how that looked for the top of the page but I really didnt like it so I just added some title and subtitle rows as placeholders for more interesting things to come. I had a picture of myself on one of the cards but it seemed a little austentatious, maybe in the future I will find a better way to do this. A big win! I thought it would be cool to display a carousel that shows my previous attempts at blogs and with the guided assistance of the bootstrap documentation we made it! I added some css rules for additional control of the carousel element because I didnt want it taking up the whole width of the page, then I was having issues with the reference images being slightly different size and even that was figured out! The coursera classes are going very well and I think are a fantastic learning tool. I ripped through the introduction to frontend developement course package in 4 days and now I am deep into part 2 of 9 which is javascript. Re learning how to make else/if statements or switches if you prefer and make nested loops and even objects at this point. I feel like im missing some key ingrediants to better understand how the files and libraries should be packed before setting your webpage loose on the world. Oh well thats why I'm here!",
      "date": "3/3/2024",
      "createdAt": "3/3/2024"
    },
    {
      "postId": 17,
      "title": "Feb.18.2024 Upgrades!",
      "content": "Another exciting episode of derp! So I have completed the Javascript module on Coursera and it was so good! I have previously worked with basic loops and functions, even objects but this was a real eye opening experience to just how deep the rabbit hole goes. I am sure I don't have any real idea but I have fallen off the edge of the confidence graph and now comes the not so sexy part of digging myself out. In the JS module it covered classes and inheritance models as well as DOM operators, testing code using throw/catch methods as well as Jest for testing code modules. I am not going to lie it is overwhelming. I hope that over time these concepts sink in  with more use and application. I feel like there is this strange point in my mind that I feel so confident going through the course and doing the material and when applying it to my own work...its like starting over. I think, for me at least, the real key is going to be directly applying these concepts myself as that seems to be where the veil really is. I am in a strange place right now. I am so intimidated by all this and yet I can see the infinite possibilies of these tools and concepts and it makes me so damn excited. I have been trying so hard at this but I have to find a way to do better/more. This week at my job I worked just over 40 hours and on programming I have worked just over 30. If I can find a way to do 40-40 then at least I can say I am working full time at this as well. Time is not the only factor here I have been using MS notepad for note taking and saving code snippets and it has quickly become unmanagable and messy. I am going to find something better to use, that I can keep notes in MUCH more structured way. On a positive note! I have made some minor strides towards understanding how package managment works for websites, and thanks to some guidance from my friend I know that not the entire library I am using has to be uploaded to say my github in this case. I created a .gitignore file and in the future will upload only files/folders required in the package.json. I have made progress on this blog in both the forward and backward directions! I have implemented a navbar with some links to future content I am going to implement. My carousel is kind of broken at the moment I made some changes to how it is handled by bootstrap classes instead of forcing it with css now it sticks the left side of the screen inexplicably. I have added date stamps to these posts, inserted that gaudy photo of myself for reasons unknown to even me. I guess it is my blog there's my face enjoy! Added a linkedIn link that just floats under my subtitle I will either add it into another element or perhaps change it into a links section or something that is not what is it now! So many changes to be made. I think since tomorrow is holiday and I have it off work I will spend significant time on this layout and get it looking not so ROUGH so instead of pushing this branch today(sunday) like I normaly would I am just writing this cathardic post today and going to push the changes tomorrow after some adjustments. I originally had this idea of having a button to press to make these posts instead of typing it out in html (now bootstrap) and I think I have a good idea of how to go about that now with some things I learned in the course using DOM manipulation and classes and inheritance. I am going to try and implement that now I just forsee an issue, If a make a button right on the page that allows me to insert a new post in this current style what stops visitors to the page clicking the button and spamming things of their own? they wont have permission to push the code into the DOM somehow I hope. Either way im going to structure it now, run some Jest testing on it and troubleshoot later WHAT COULD GO WRONG",
      "date": "3/3/2024",
      "createdAt": "3/3/2024"
    },
    {
      "postId": 18,
      "title": "Goodnight netcity!",
      "content": "okay the function works to insert new content.I have used figma to come up with a better layout for the blog in general and at the bottom of this page is a pic of the current working model I will give it a week and see if I still like it...if not I will change it. for now I have made progress on this version and its time to commit a new branch! Good night netcity!",
      "date": "3/3/2024",
      "createdAt": "3/3/2024"
    },
    {
      "postId": 19,
      "title": "Date stamp boogaloo",
      "content": "Okay it seems that the date stamps are are posting only the most current date of whatever post is most recent, which in retrospect makes sense as I dont have the date being saved anywhere.Ok so some progress this week and some struggle! still blasting cousera course thats all going well. I have a layout ready for this blog I have experimented with using both bootstrap default grid and css grid to try and see how it builds out...needless to say I think default grid is going to be the path forward. I spend a nice portion of the day learning how to extract sass files from bootstrap and switching between the different grid systems, recompiling etc. I have to rebuild the blog layout as it was more or less destroyed when I tried to switch to different grid system. I think instead of fixing the date stamp issue now I will prioritize pushing out the new layout and after that with my card elements/'modals being the blog posts I will attempt to save the post date to local file for now and if that works kinda of use that system until a real back end can be developed in the future. I think that can work for all kinds of data I need to save for the blog that is going to be made with functions and OOP systems I make over time. I have learned a lot more about html meta data as well as more proper html structure that is more readable for bots and SEO. I have began to delve into little bits of animation through the course materal, so far on canvas. I have had a cool idea for a little 2d browser game for a long time and I hope I can learn enough through this course to get a firm grasp on how to go forward with it. If not then in the future when I have time I would really like to delve into it a little bit more. I think with electron and react it should be possible to publish it on mobile as well. Oh well that is for a future endeavor! So all in all another big week, more stuff breaking, a lot of learning, a lot of growing pains. Alas, we press on! p.s on this push I updated metadata in the header and fixed some typos",
      "date": "3/3/2024",
      "createdAt": "3/3/2024"
    },
    {
      "postId": 20,
      "title": "1 Problem = thousand solutions",
      "content": "I wonder if writing this to html is even a good idea, wouldn't it just clutter up the index file after a while? I wonder what a better way to do this would be. Okay the current structure is a function that searches for my posts section by id and then within it creates 2 nested div elements (by appending order). Then it creates a <p> element and a <span> element. and of course each element gets passed class attributes so they look the same as the first two posts within the bootstrap framework. All off the elements are nested inside of if statements so that I can throw errors if any part of the function is not working it will help me track down where. the real fun began when I tried to get the <span> which is functioning as my date stamp to appear at the beginning of the text post instead of at the end, which was the default when using a logical appending heirarchy. I tried using before() and after() methods but those placed the span outside of the p element entirely. so the fix ultamitely was para.appendChild(document.createTextNode(newText)) in the line right after I append my span element into my p element.As far as I understand this creates a text node that is a child node of the p element , just like the span element, and since I have the span element appending first it gets listed first within the children of the p element and BOOOOM its working. The later stages of this will include refactoring the code. Ultamitely when this goes live I want to be able to log in as an admin and do this through a button, which I tried to do already but there are clear security issues there if anyone can just jam anything into this thing. For today I have a working function for all my new posts that does not require me to build new html every time.",
      "date": "3/3/2024",
      "createdAt": "3/3/2024"
    },
    {
      "postId": 21,
      "title": "The depths pt.1",
      "content": "I went way out of my depth this week. Here is how I overcame every obstacle and had two great moments of silent success. The DerpBloggins remodel is done(for md sized viewports and up). I started two weeks ago with a figma design layout that I thought would be doable and an expectation that I could figure it out along the way. I nearly drown. I gave myself and week to see if I still liked the scheme and after 1hour last weekend sunday of adjust the strap color from purple to this teal you see now, in the same tetrad of complimentary colors, just a little more me. I was sick this week so I took it off work and went ham. doing the layout was perhaps the greatest learning experience so far, with the Coursera material I learned the basics of the bootstrap library...this has been taken to a level above and beyond. I have become probably the most frequent user of the bootstrap docs this week. I have massive issues getting the nesting or rows at first and could not understand how to create the look I wanted from my figma design. The first day was crazy and I began to think I may have to change I approach from the default bootstrap grid to the css-grid also avail in bootstrap. I had to learn how to recompile parts of the bootstrap library that are not avail be default. This also answered my questions about how to use sass in this lib. as well. After this I decided that css-grid is not the way and switched back to OG version determined to learn how to use it properly. After days of trialing and figuring it out and trying different implementations I have the page framed! Had to learn how to use webpack btw to pack some backend modules I ended up using. getting the teal color straps to work as they do on the elements was a learning curve on how nesting rows really works, and I learned a nice way to test every, just put border class attribute on everything and then you can see clearly the exact area that the row or col in question is using and what is nesting into what. the top nav bar element I had to get rid of the gutter in between the title strap and the actual nav row where the links reside. Nesting a carousel, text and a photo into a matching row element to the achievements column was a blast! once I had the border trick down things started to become clear to me how bootstrap worked and how I could use it to get specifically what I wanted out of it. I had the layout done, css applied looking almost exactly like the figma design with the card elements as my blog posts written into the html, as place holders, and everyone was looking good! little did I know that generating client side JS code to automate these blog posts would lead me down a trail of learning how to set up a local server using  Express.js, set up the code to read and write files to the server and then utilize the client side code to serve these files to the browser as an array of objects (JSON data) and then when the data is retrieved from the server wrap the data in card element html to display to the end user...stay tuned for part 2",
      "date": "3/3/2024",
      "createdAt": "3/3/2024"
    },
    {
      "postId": 22,
      "title": "The depths pt2",
      "content": "There is some jank for me to iron out still left, I have to make this interactive and responsive and some issues with the date stamp game still and a bucket full of other things. The base product is functional. When I click the post button a modal is called to the screen where I type these posts now. I input the title and the content and click the save button. There is an event listener on the save post button, that when clicked converts the post data into a json object and sends it my local server. the local server then writes the json file into the posts.json file with a postId, content, and date keys. When the page is loaded in the browser the json card elements in the save file are pulled to the browser and the data is displayed as card html elements. each one has an event listener that if it is clicked a different modal is called, to view the full post content, as the cards only hold a specified number of characters. that is the functionality in a nutshell but let me tell you the things I had to learn and figure out along the way to make this work have been staggering. Considering my old function I had to make blog posts, which required the function to be left in tact and the parameter, being the text content, to be left in the scripts.js file to maintain persistence, this is a whole new world. I have same remaining security concerns to be hammered out before I push the largest branch this blog will probably ever see.  I mean I made a CardPost class that has generator functions for html, nested event listeners and saveToFile functions within it.I have event listeners for DOMContentLoaded that pulls saved posts from the backend iterates over each object in the array and loads it to the browser inside nice card html for easy displaying of each individual post on the page. inserts and pulls information from the correct modal to save or to display the right content from the right post. This has single handedly been my greatest programming achievement to date and I want to do so much more! I have proven to myself that it is possible to do these things that are out of my comfort zone and do them exactly like I imagined to begin with. Tonight I will spend trying to fix some minor hiccups with the card elements not all displaying with the same height and whatever else I can fit in timewise. I cannot wait to polish this blog and give it that special something. for now it is a MVP and I am so proud to see it here in front of me when just a week ago it was a hope that I could do this at all. HUGE GAINS now I have to finish coursera program and when this is polished up start on my next project, which is going to be a React/Electron build multiplication table app, that doesn't spam the user with adds and is not necessarily child themed. I was trying to find a good one for the longest time ended up using a kids one that is passable. I think I can do better. till next time good night netcity!",
      "date": "3/3/2024",
      "createdAt": "3/3/2024"
    },
    {
      "title": "{{{{}}}}Learning React{}{{}}{}",
      "content": "tonights episode of derp is brought to you by...sandwiches...just sandwiches go get one now! oh and tacos! SO i have been hard at work all week learning to use the react library, JSX hooks, components all that jazz. It seems very interesting to me, the syntax is not too hard to get right since I have a little experience with JS vanilla at this point. I keep forgettting to declare my vars when writing arrow functions though...have to keep reminding myself the its not just:  list = () => {} its: const list = () => {}. but other than a few minor hangups its actually very cool stuff to learn, I am excited to do my own project using react to see just how sweet components can be. So other than that I have been on schedule, min 3 hours every night of coursera school, and min 8 hours of school/personal projects on weekends. That makes five consecutive weeks of awesome. ANYWAY I know you wanna know about the blog updates. So I decided that having two nav bars is a little strange. Got rid of the top one, because everyone has a top one right... and kept the middle nav bar there, just integrated and combined some links. In its place I have a little color animation deal happening, im not sure if this is permanent or not, but I do want to make it mouse interactive to some degree here soon.(if I decide to keep it at all). I have added functionality to the Github and LinkedIn buttons, which now send you (in a new page) to the desired destination. I changed how the buttons react when the are hovered over, they no longer blend with the background but changed background and border color. I adjusted the teal color strap on the top row element to align with the columns under it. I made an adjustment to the character length cut off for the card post elements so they display with uniform height...at least on large viewports. This is going to require me to insert a row counter I think or I can hard code the height of the elements, but I want to see how it all goes down when I make it all responsive. Speaking of which! next weekend, will probabaly be my last full weekend working on blog remodeling. I am going to dedicated all the time to making it responsive to viewport sizes and then if there is time left after that I will add some interactivity to the top row color animation OR get rid of it..WHO KNOWS! Now when you scroll over the card elements with your mouse there is a box-shadow the happens, to better navigate and seperate the elements. I think if this process continues to work and save as it has been at the end of the month I will be good to clean up the code in the html and scripts.js files to get rid of my old posts that I have just commented out for now in case something goes wrong with the new backend. There have been quite a few tweaks to the scripts.js refactoring some of the code, dumping redundant parts, getting rid of double date/id stamps things along those lines. It has been a hard but rewarding week. I wonder what I will be able to do if I keep this up for a year...",
      "createdAt": "3/10/2024",
      "postId": 33
    },
    {
      "title": "SooOOO000 wOrK happened...",
      "content": "ladies and gentlemen it was bound to happen sooner or later...my RL job got busy AF and I had to work all weekend which is super sadge tbh. I was going to work on the responsiveness of the blog this weekend, it looks like I might have to try and tickle away at it during the coming week/weekend. Although it seems I am going to be working on the foreseeable weekends as well. I will not let this stop my progress here. I have been slamming coursera hard this week/weekend STILL and im just waiting for other users to grade my final React project as a basic, calculator app. I tried to make it much more fancy than what was required, but that turned out to be much more involved than I thought. So I settled for making some of my own input buttons instead of the user having to use the keyboard and make it look much better with some CSS styling. So the React module is done I wonder what is next, I am getting close to completing the entire course! Damn, im upset about not getting the blog update done that I wanted...oh well things are going to happen I think the most important thing is consistency and perseverance. I am learning more and more that understanding react really needs me to stop thinking vanilla JS and approach it differently! Oh yes and I spent some quality time at work drawing out how my next project will work. the multiplication table app. I drew up a flow diagram of what I want the components to be and what should lead into what. I think at some point at work when I get time I will try and figure out the details, like what page is sending data to where and things like that. I think I came up with a interesting idea for a css style and layout, I will put it into Figma here in a couple days and see how I like it! Anyways enough rambling on! onward and foward and awayYYyyyY!",
      "createdAt": "3/17/2024",
      "postId": 36
    }
  ]
}